// Імпортуємо допоміжну функцію з next-intl, яка дозволяє
// описати конфігурацію маршрутизації для багатомовності
import { defineRouting } from "next-intl/routing";

// Створюємо та експортуємо конфіг об’єкта routing.
// Він містить перелік локалей і дефолтну локаль.
// Цей об’єкт потім використовується у навігації та серверній конфігурації.
export const routing = defineRouting({
  // Усі підтримувані локалі (порядок не критичний).
  // Ми додаємо 4 мови: українська (ua), англійська (en),
  // німецька (de) та російська (ru).
  locales: ["en", "de","ru", "ua"],

  // Дефолтна локаль — та, яка застосовується якщо:
  // 1) користувач не вказав мову в URL,
  // 2) або вказав непідтримувану мову.
  defaultLocale: "en",
});

// (Необов’язково) Експортуємо тип Locale, щоб у коді можна було
// типізувати пропси/функції значеннями лише з підтримуваних локалей.
export type Locale = (typeof routing.locales)[number];
